apim-migration-testing-tool-rest-assured/RESTAssuredAutomation/src/test/payloads/authenticateRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.ws.um.carbon.wso2.org">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:authenticate>
         <!--Optional:-->
         <ser:userName>admin</ser:userName>
         <!--Optional:-->
         <ser:credential>admin</ser:credential>
      </ser:authenticate>
   </soapenv:Body>
</soapenv:Envelope>